research/visualization_methods/outputs/Bayesian Linear Regression__linear_regression_unknown_noise/linear_regression_unknown_noise.mmd
graph TD
  InverseGamma["InverseGamma"]
  Normal["Normal"]
  a["a"]
  b["b"]
  mean["mean"]
  s["s"]
  variance["variance"]
  x["x"]
  y ["y "]
  InverseGamma --> s
  Normal --> a
  Normal --> b
  Normal --> y 
  a --> y 
  b --> y 
  mean --> a
  mean --> b
  mean --> y 
  s --> y 
  variance --> a
  variance --> b
  variance --> y 
  x --> y 
